package kosta.api;

import java.util.Scanner;

public class RegularExam {
	
	public static void main(String[] args){
		Scanner sc = new Scanner(System.in);
		System.out.print("¹®ÀÚ¿­ ÀÔ·Â: ");
		String str = sc.nextLine();
		
		if(str.matches(".*abc.*")){ //'*' ¹®ÀÚ¿­ÀÌ ¿©·¯°³ ³ª¿Íµµ »ó°ü¾øÀ¸¸ç, ¹®ÀÚ¿­¾ÕÀÌ ¾ø¾îµµ µÊ
			System.out.println("¸ÅÄª"); //abc°¡µé¾î°¡¸é ¸ÅÄª
		}else{
			System.out.println("ºñ¸ÅÄª");
		}
		
		
		//¼ıÀÚ¸¸ 3ÀÚ¸® ÀÔ·Â
		if(str.matches("[\\d]{3}")){ //  '\\'´Â ¹®ÀÚ¿­·Î ÀÎ½ÄÇØ´Ş¶ó´Â ¹®¹ıÀû ÀÇ¹Ì
			System.out.println("¸ÅÄª"); 
		}else{
			System.out.println("ºñ¸ÅÄª");
		}
		
		//¾ËÆÄºª, ¼ıÀÚ¸¸ 5ÀÚ¸® ÀÌ»ó
		if(str.matches("[\\w]{5}")){ 
			System.out.println("¸ÅÄª"); 
		}else{
			System.out.println("ºñ¸ÅÄª");
		}
		
		//ÇÑ±Û¸¸ 3~5ÀÚ¸®
		if(str.matches("[°¡-ÆR]{3,5}")){ 
			System.out.println("¸ÅÄª"); 
		}else{
			System.out.println("ºñ¸ÅÄª");
		}
		
		
		//dolsam77@nate.com => ¼º°ø
		//32dolsam77@nate,com =>½ÇÆĞ
		//dolsam77nate.com =>½ÇÆĞ
		//dolsam77@nate.comcom =>½ÇÆĞ	
		if(str.matches("^[\\D]\\w+@\\w+\\.\\w{2,3}$")){  //'^'´Â ¹®ÀåÀÇ Ã³À½ ^´Ü¾î·Î ¹®ÀåÀÌ ½ÃÀÛµÊ 
			System.out.println("¼º°ø"); 
		}else{
			System.out.println("½ÇÆĞ");
		}
		
		
		//¾ÆÀÌµğ Ã³À½ ¼ıÀÚ±İÁö
		//4~7ÀÚ¸®
		if(str.matches("^[[\\D]\\w]{4,7}$")){ 
			System.out.println("¸ÅÄª"); 
		}else{
			System.out.println("ºñ¸ÅÄª");
		}
		
		//ÆÄÀÏÀÌ¸§°ú È®ÀåÀÚ¸¦ ÀÌ¿ëÇÑ Ã¼Å©
		//abc.jpg => ¸ÅÄª
		//abc.gif
		//abc.png	
		//erw.txt => ºÒ°¡
		//erw.pdf , erwjpg	
		if(str.matches("^\\S+\\.(?i)(jpg|gif|png)$")){ // '\\S' °ø¹é¹®ÀÚ ºÒÆ÷ÇÔ '(?i)' ´ë¼Ò¹®ÀÚ ±¸º°ÇÏÁö¸»¶ó´ÂÇ¥½Ã
			System.out.println("°¡´É");
		}else {
			System.out.println("ºÒ°¡´É");
		}
		
		/*¹®ÀÚ¿­ º¯°æ°ú Á¦°Å*/
		String message = "SW °³¹ßÀÚ Ã³¿ì¿Í ±Ù¹«¿©°Ç123 ¼±Áø±¹ ¼öÁØÀ¸·Î °³¼±ÇØ¾ß ¡¼¼­¿ï=´º½Ã½º¡½543±èÇü¼· ±âÀÚ = ¹Ú±ÙÇı ´ëÅë·ÉÀº 23ÀÏ ¼ÒÇÁÆ®¿ş¾î(SW) Áß½É»çÈ¸¸¦ ½ÇÇöÇÏ433±â À§ÇØ¼­´Â SWÀÇ °¡Ä¡¸¦ Á¦´ë·Î ÀÎÁ¤ÇÏ´Â µ¥¼­ Ãâ¹ßÇØ¾ß ÇÑ´Ù°í ¸»Çß´Ù. ¹Ú ´ëÅë·ÉÀº ÀÌ³¯ ¿ÀÀü ÆÇ±³ Å×Å©³ë¹ë¸®¿¡¼­ ¿­¸° 'SW Áß½É»çÈ¸ ½ÇÇö Àü·«º¸°íÈ¸'¿¡¼­ ¿ì¸®³ª¶ó°¡ IT °­±¹À¸·Î Áö¼Ó ¹ßÀüÇÏ±â À§ÇØ¼­´Â SW ºĞ¾ßÀÇ °æÀï·Â È®º¸°¡ ½Ã±ŞÇÑ °úÁ¦¶ó¸ç ÀÌ°°ÀÌ ¹àÇû´Ù. ¹Ú ´ëÅë·ÉÀº ½ÃÀå¿¡¼­ SWÀÇ °¡Ä¡¸¦ Á¦´ë·Î ÀÎÁ¤ÇÏÁö ¾Ê¾Æ SW ±â¾÷µéÀÇ ¼öÀÍ¼ºÀÌ ¾ÇÈ­µÇ°í, ¿ì¼öÇÑ ÀÎÀç°¡ À¯ÀÔµÇÁö ¾Ê´Â ¾Ç¼øÈ¯ÀÇ °í¸®¸¦ ²÷¾î¾ß ÇÑ´Ù¸ç °ø°øºÎ¹®ÀÇ SW Á¦°ªÁÖ±â ³ë·ÂÀÌ ¹Î°£À¸·Î È®»êµÅ Ã¢ÀÇ¼º°ú ³ë·ÂÀÌ ¿ÂÀüÈ÷ º¸´ä ¹Ş´Â È¯°æÀ» Á¶¼ºÇØ ³ª°¡µµ·Ï ³ë·ÂÇÒ °ÍÀÌ¶ó°í ¾à¼ÓÇß´Ù.  ÀÌ¾î ±×µ¿¾È °ø°ø Á¤º¸È­»ç¾÷ÀÌ ¿ÀÈ÷·Á ¹Î°£ SW ½ÃÀåÀ» À§Ãà½ÃÅ²´Ù´Â ÁöÀûÀÌ ÀÖ¾ú´Âµ¥ ¹Î°£ÀÇ ±â¼ú°ú »ê¾÷¹ßÀüÀ» À§ÇÑ ¸¶Áß¹° ¿ªÇÒÀ» ÇØ2342¾ß ÇÒ Á¤ºÎ°¡ ¿ÀÈ÷·Á ¹Î°£½ÃÀåÀ» À§Ãà½ÃÅ°´Â ÀÏÀÌ ÀÖ¾î¼­´Â ¾È 234µÉ °ÍÀÌ¶ó¸ç ¹Î°£½ÃÀå¿¡ ¹ÌÄ¡´Â ¿µÇâÀ» »çÀü¿¡ Æò°¡ÇÏ´Â µî °ø°ø Á¤º¸È­»ç¾÷ ÃßÁøÀıÂ÷¸¦ °³¼±ÇÒ ÇÊ¿ä°¡ ÀÖ´Ù°í Áø´ÜÇß´Ù.  ¹Ú ´ëÅë·ÉÀº ¶Ç SW °³¹ßÀÚÀÇ Ã³¿ì¿Í ±Ù¹«¿©°Çµµ ¼±Áø±¹ ¼öÁØÀ¸·Î °³¼±ÇÒ ÇÊ¿ä°¡ ÀÖ´Ù¸ç SW °³¹ßÀÚ°¡ '²ŞÀÇ Á÷¾÷'ÀÌ µÅ ÃÖ°íÀÇ ÀÎÀçµéÀÌ À¯ÀÔµÇ°í ÀÌµéÀÌ SW »ê¾÷ ¹ßÀüÀ» ÀÌ²ø¾î°¡°í, ±×·¡¼­ ¼ÒÇÁÆ®¿ş¾î °³¹ßÀÚµéÀÇ 323Ã³¿ì°¡ ´õ¿í °³¼±µÇ´Â ¼±¼øÈ¯ ±¸Á¶¸¦ ¸¸µé¾î ³ª°¡¾ß ÇÏ°Ú´Ù°í °­Á¶Çß´Ù.  Æ¯È÷ ÀÚ¶ó³ª´Â ¹Ì·¡¼¼´ë¿¡ ´ëÇÑ SW ±³À°ÀÌ ¹«¾ùº¸´Ù Áß¿äÇÏ´Ù¸ç SW Áß½É»çÈ¸ÀÇ ÁÖ¿ªÀÌ µÉ ¹Ì·¡ ¼¼´ë°¡ 'ÄÄÇ»ÅÍÀû »ç°í'¸¦ ±âº»¼Ò¾çÀ¸·Î °®Ãâ ¼ö ÀÖµµ·Ï ÃÊ¡¤ÁßµîÇĞ±³¿¡¼­ºÎÅÍ SW±³À°342À» °­È­ÇØ¾ß ÇÑ´Ù°í ¸»Çß´Ù.";
		//SW => ¼ÒÇÁÆ®¿ş¾î
		String result = message.replaceAll("SW","¼ÒÇÁÆ®¿ş¾î") ;
		System.out.println(result);
		
		//ÇØ´ç ¹®ÀÚ¿­¿¡ ¼ıÀÚÁ¦°Å
		String result2 = message.replaceAll("[0-9]", "");
		System.out.println(result2);
		
	}

}
